import 'dart:convert';
import 'package:flutter/services.dart';

class BibleService {
  // JSON ఫైల్ ని లోడ్ చేసి, డేటాని క్లీన్ చేస్తుంది
  Future<Map<String, dynamic>> loadBookData(int bookId) async {
    // ఉదాహరణకి assets/bible_json/1.json అని ఉండాలి
    final String response = await rootBundle.loadString('assets/bible_json/$bookId.json');
    final Map<String, dynamic> fullData = json.decode(response);
    
    // నీ JSON లో మొదటి కీ పుస్తకం పేరు (e.g. 1 కొరింథీయులకు)
    // మనం ఆ లోపల ఉన్న అధ్యాయాల డేటాని మాత్రమే తీసుకుందాం
    String bookName = fullData.keys.first;
    Map<String, dynamic> chapters = fullData[bookName];
    
    return {
      "name": bookName,
      "chapters": chapters
    };
  }

  // బైబిల్ 66 పుస్తకాల పేర్లు (వరుస క్రమంలో)
  final List<String> bookNames = [
    "ఆదికాండము", "నిర్గమకాండము", "లేవీయకాండము", "సంఖ్యాకాండము", "ద్వితీయోపదేశకాండము",
    "యెహోషువ", "న్యాయాధిపతులు", "రూతు", "1సమూయేలు", "2సమూయేలు",
    "1రాజులు", "2రాజులు", "1దినవృత్తాంతములు", "2దినవృత్తాంతములు", "ఎజ్రా",
    "నెహెమ్యా", "ఎస్తేరు", "యోబు", "కీర్తనలు", "సామెతలు",
    "ప్రసంగి", "పరమగీతము", "యెషయా", "యిర్మీయా", "విలాపవాక్యములు",
    "యెహెజ్కేలు", "దానియేలు", "హోషేయ", "యోవేలు", "ఆమోసు",
    "ఓబద్యా", "యోనా", "మీకా", "నహూము", "హబక్కూకు",
    "జెఫన్యా", "హగ్గయి", "జకర్యా", "మలాకీ", "మత్తయి",
    "మార్కు", "లూకా", "యోహాను", "అపొస్తలుల కార్యములు", "రోమీయులకు",
    "1కొరింథీయులకు", "2కొరింథీయులకు", "గలతీయులకు", "ఎఫెసీయులకు", "ఫిలిప్పీయులకు",
    "కొలొస్సయులకు", "1థెస్సలొనీకయులకు", "2థెస్సలొనీకయులకు", "1తిమోతికి", "2తిమోతికి",
    "తీతుకు", "ఫిలేమోనుకు", "హెబ్రీయులకు", "యాకోబు", "1పేతురు",
    "2 పేతురు", "1యోహాను", "2యోహాను", "3యోహాను", "యూదా", "ప్రకటన గ్రంథము"
  ];
}