import 'dart:convert';
import 'package:flutter/services.dart';

class BibleService {
  // పుస్తకం పేరును బట్టి JSON ఫైల్ ని లోడ్ చేస్తుంది
  Future<Map<String, dynamic>> loadBook(String bookName) async {
    // ఉదాహరణకు: assets/bible_json/ఆదికాండము.json
    final String response = await rootBundle.loadString('assets/bible_json/$bookName.json');
    final Map<String, dynamic> data = json.decode(response);
    
    // JSON లోపల ఉన్న మొదటి కీ ని తీసుకుంటుంది
    String keyInJson = data.keys.first;
    return {"name": keyInJson, "chapters": data[keyInJson]};
  }

  // నీ ఫోల్డర్ లో ఉన్న ఫైల్ పేర్లు ఇక్కడ ఖచ్చితంగా ఉండాలి
  final List<String> bookNames = [
    "ఆదికాండము", "నిర్గమకాండము", "లేవీయకాండము", "సంఖ్యాకాండము", "ద్వితీయోపదేశకాండము",
    "యెహోషువ", "న్యాయాధిపతులు", "రూతు", "1సమూయేలు", "2సమూయేలు",
    "1రాజులు", "2రాజులు", "1దినవృత్తాంతములు", "2దినవృత్తాంతములు", "ఎజ్రా",
    "నెహెమ్యా", "ఎస్తేరు", "యోబు", "కీర్తనలు", "సామెతలు",
    "ప్రసంగి", "పరమగీతము", "యెషయా", "యిర్మీయా", "విలాపవాక్యములు",
    "యెహెజ్కేలు", "దానియేలు", "హోషేయ", "యోవేలు", "ఆమోసు",
    "ఓబద్యా", "యోనా", "మీకా", "నహూము", "హబక్కూకు",
    "జెఫన్యా", "హగ్గయి", "జకర్యా", "మలాకీ", "మత్తయి",
    "మార్కు", "లూకా", "యోహాను", "అపొస్తలుల కార్యములు", "రోమీయులకు",
    "1కొరింథీయులకు", "2కొరింథీయులకు", "గలతీయులకు", "ఎఫెసీయులకు", "ఫిలిప్పీయులకు",
    "కొలొస్సయులకు", "1థెస్సలొనీకయులకు", "2థెస్సలొనీకయులకు", "1తిమోతికి", "2తిమోతికి",
    "తీతుకు", "ఫిలేమోనుకు", "హెబ్రీయులకు", "యాకోబు", "1పేతురు",
    "2పేతురు", "1యోహాను", "2యోహాను", "3యోహాను", "యూదా", "ప్రకటన గ్రంథము"
  ];
}